/**
 * 本文件为系统默认配置文件
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 * 请勿修改！
 */

let config = {
    "http": true, // bool 
    "http_host": "127.0.0.1", // string
    "http_port": 80, // int

    "https": false, // bool
    "https_host": "127.0.0.1", // string
    "https_port": 443, // int
    "https_key": "", // string
    "https_cert": "" // string
};

module.exports = config;